Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: pval *resource_id; RESOURCE *resource; int type; convert_to_long(resource_id); php3_list_delete(resource_id - value.lval);
es: pval *id_recurso; RESOURCE *recurso; int tipo; convert_to_long(id_recurso); php3_list_delete(id_recurso - value.lval);

source: PHP has a standard way of storing persistent resources (i.e., resources that are kept in between hits).
es: El PHP 3.0 tiene una forma estándar de almacenar recursos persistentes (es decir, recursos que se mantienen entre accesos).

source: The first module to use this feature was the MySQL module, and mSQL followed it, so one can get the general impression of how a persistent resource should be used by reading mysql.c.
es: El primer módulo que utilizó esta característica fue el MySQL y tras él fue el mSQL, así que uno puede hacerse una buena idea de cómo utilizar un recurso persistente leyendo mysql.c.

source: The functions you should look at are:
es: Las funciones a revisar son:

source: The general idea of persistence modules is this:
es: La idea general de los módulos persistentes es:

source: Code all of your module to work with the regular resource list mentioned in section (9).
es: Codifique todos sus módulos para que funcionen con la lista regulares de recursos mencionadas en la sección (9).

source: Code extra connect functions that check if the resource already exists in the persistent resource list.
es: Codifique funciones extra de conexión que comprueben si el recurso ya está en la lista de recursos persistentes.

source: If it does, register it as in the regular resource list as a pointer to the persistent resource list (because of 1., the rest of the code should work immediately).
es: Si ya está, regístrelo en la lista regular como un puntero a la lista de recursos persistentes (debido a 1., el resto del código deberá funcionar de inmediato).

source: If it doesn' t, then create it, add it to the persistent resource list AND add a pointer to it from the regular resource list, so all of the code would work since it's in the regular resource list, but on the next connect, the resource would be found in the persistent resource list and be used without having to recreate it.
es: Así todo el código funcionará porque está en la lista regular, pero en la siguiente conexión el recurso ya estará en la lista persistente y podrá ser usado sin re-crearlo.

source: LE_MYSQL_LINK for non-persistent link and LE_MYSQL_PLINK for a persistent link).
es: Deberá registrar estos recursos con un tipo diferente (por ejemplo, LE_MYSQL_LINK para el enlace no persistente y LE_MYSQL_PLINK para un enlace persistente).

source: If you read mysql.c, you 'll notice that except for the more complex connect function, nothing in the rest of the module has to be changed.
es: Si se leyera mysql.c, notaría que, salvo por que hay una función de conexión más compleja, no hay que cambiar nada más del resto del módulo.

source: The very same interface exists for the regular resource list and the persistent resource list, only 'list' is replaced with'plist ':
es: Existe exactamente la misma interfaz para la lista de recursos regular y para la lista de recursos persistente, pero cambiando únicamente 'lista' por 'listap ':

source: php3_plist_insert( ptr, type) - returns the'id 'of the newly inserted resource
es: php3_plist_insert( ptr, tipo) - devuelve el 'id 'del recurso recién insertado

source: php3_plist_delete( id) - delete the resource with the specified id
es: php3_plist_delete( id) - borra el recurso con el id especificado

source: php3_plist_find( id,*type) - returns the pointer of the resource with the specified id, updates'type 'to the resource's type
es: php3_plist_find( id,*tipo) - devuelve el puntero al recurso con el id especificado, y actualiza 'tipo 'al tipo del mismo

source: However, it 's more than likely that these functions would prove to be useless for you when trying to implement a persistent module.
es: Sin embargo, es más que probable que estas funciones se muestren inútiles cuando intente implementar un módulo persistente.

source: Typically, one would want to use the fact that the persistent resource list is really a hash table.
es: Típicamente usted querrá usar el hecho de que la tabla de recursos persistentes es en realidad una matriz asociativa.

source: For instance, in the MySQL / mSQL modules, when there' s a pconnect() call (persistent connect), the function builds a string out of the host / user / passwd that were passed to the function, and hashes the SQL link with this string as a key.
es: Por ejemplo, en los módulos MySQL / mSQL, cuando hay una llamada a pconnect() (conexión persistente), la función combina en una cadena el servidor / usuario / clave que se pasaron a la función y codifica el enlace SQL con esta cadena como clave.

source: The next time someone calls a pconnect() with the same host / user / passwd, the same key would be generated, and the function would find the SQL link in the persistent list.
es: La siguiente vez que alguien llame a pconnect() con el mismo servidor / usuario / clave, se generará la misma clave, y la función hayará el enlace SQL en la lista persistente.

source: Until further documented, you should look at mysql.c or msql.c to see how one should use the plist 's hash table abilities.
es: Hasta que se documente mejor, deberá mirar en mysql.c o en msql.c para ver como utilizar las capacidades de matriz asociativa de la listap.

source: One important thing to note: resources going into the persistent resource list must *NOT* be allocated with PHP' s memory manager, i.e., they should NOT be created with emalloc(), estrdup(), etc.
es: Una cosa importante: a los recursos que van a parar a la lista de recursos persistentes *NO* se les debe asignar memoria usando el gestor de memoria del PHP, es decir, que NO deben ser creados utilizando emalloc() o estrdup(), etc.

source: Rather, one should use the regular malloc(), strdup(), etc.
es: En este caso se debe usar las funciones habituales malloc(), strdup(), etc.

source: The reason for this is simple - at the end of the request (end of the hit), every memory chunk that was allocated using PHP's memory manager is deleted.
es: La razón para esto es simple: al final de la petición (final del acceso), se borran todos los trozos de memoria asignados con el gestor de memoria del PHP.

source: Since the persistent list isn' t supposed to be erased at the end of a request, one mustn't use PHP's memory manager for allocating resources that go to it.
es: Como la lista persistente se supone que no se debe borrar al final de una petición, no se debe utilizar el gestor de memoria del PHP para asignar memoria a los recursos de la misma.

source: When you register a resource that 's going to be in the persistent list, you should add destructors to it both in the non-persistent list and in the persistent list.
es: El destructor de la lista no persistente no deberá hacer nada.

source: The destructor in the non-persistent list destructor shouldn 't do anything.
es: El de la lista persistente deberá liberar adecuadamente los recursos obtenidos por dicho tipo (por ejemplo, memoria, enlaces SQL, etc.).

source: The one in the persistent list destructor should properly free any resources obtained by that type (e.g. memory, SQL links, etc).
es: Tal y como pasa para los recursos no persistentes, DEBERÁ añadir destructores para cada recurso aunque no sean necesarios y estén vacíos.

source: Just like with the non-persistent resources, you *MUST* add destructors for every resource, even it requires no destruction and the destructor would be empty.
es: Muchas de las características del PHP3 pueden ser configuradas en tiempo de ejecución.

source: Remember, since emalloc() and friends aren't to be used in conjunction with the persistent list, you mustn't use efree() here either.
es: Estas directivas de configuración pueden aparecer tanto en el fichero php3.ini o, en el caso de la versión de módulo del Apache, en los archivos .conf del propio Apache.

source: Many of the features of PHP can be configured at runtime.
es: La ventaja de tenerlos en los archivos .conf del Apache es que se puden configurar directorio por directorio.

source: These configuration directives can appear in either the designated php3.ini file, or in the case of the Apache module version in the Apache .conf files.
es: Esta granularidad en la configuración es especialmente útil cuando un servidor soporta múltiples servidores virtuales.

source: The advantage of having them in the Apache .conf files is that they can be configured on a per-directory basis.
es: Añada la directiva a la estructura php3_ini_structure en mod_php3.h.

source: This means that one directory may have a certain safemodeexecdir for example, while another directory may have another.
es: En main.c, edite la función php3_module_startup y añada la llamada a cfg_get_string() o a cfg_get_long() según se requiera.

source: This configuration granularity is especially handy when a server supports multiple virtual hosts.
es: Añada la directiva, las restricciones y un comentario a la estructura php3_commands en mod_php3.c.

source: The steps required to add a new directive:
es: Cuidado con la parte de restricciones.

source: Add directive to php3_ini_structure struct in mod_php3.h.
es: Las de tipo RSRC_CONF sólo puede aparecer en los archivos .conf del Apache.

source: In main.c, edit the php3_module_startup function and add the appropriate cfg_get_string() or cfg_get_long() call.
es: Las directivas de tipo OR_OPTIONS pueden aparecer en cualquier parte, incluso en los habituales archivos .htaccess.

source: Add the directive, restrictions and a comment to the php3_commands structure in mod_php3.c.
es: Añada el elemento apropiado para su directiva, bien en php3take1handler(), bien en php3flaghandler().

source: RSRC_CONF are directives that can only be present in the actual Apache .conf files.
es: Necesita añadir su nueva directiva a la sección de configuración de la función _php3_info() en functions / info.c.

source: Any OR_OPTIONS directives can be present anywhere, include normal .htaccess files.
es: Y finalmente, por supuesto, deberá utilizar su nueva directiva en algún sitio.

source: And last, you of course have to use your new directive somewhere.
es: El valor a usar se debe asignar dinámicamente y de forma manual, pues el código de manejo de memoria intentará liberar este puntero más adelante.

source: It will be addressable as php3_ini.directive.
es: Nunca pase memoria asignada de forma estática a SET_VAR_STRING.

source: Debugger Protocol
es: Protocolo del debugger

source: PHP, which stands for "PHP:
es: PHP, acrónimo de "PHP:

source: Hypertext Preprocessor "is a widely-used Open Source general-purpose scripting language that is especially suited for Web development and can be embedded into HTML.
es: Hypertext Preprocessor", es un lenguaje "Open Source "interpretado de alto nivel, especialmente pensado para desarrollos web y el cual puede ser embebido en páginas HTML.

source: Its syntax draws upon C, Java, and Perl, and is easy to learn.
es: La mayoría de su sintaxis es similar a C, Java y Perl y es fácil de aprender.

source: The main goal of the language is to allow web developers to write dynamically generated webpages quickly, but you can do much more with PHP.
es: La meta de este lenguaje es permitir escribir a los creadores de páginas web, páginas dinámicas de una manera rápida y fácil, aunque se pueda hacer mucho más con PHP.

source: This manual consists primarily of a function reference, but also contains a language reference, explanations of some of PHP 's major features, and other supplemental information.
es: Este manual contiene principalmente una referencia de funciones PHP, tambien contiene una referencia del lenguaje, explicaciones de caracteristicas importantes de PHP y alguna información suplementaria.

source: You can download this manual in several formats at http: / /www.php.net / docs.php.
es: Este manual se puede conseguir en diferentes formatos en http: / /www.php.net / docs.php.

source: The downloads are updated as the content changes.
es: Estos ficheros son actualizados a medida que el manual vaya cambiando.

source: See also PHP History
es: Más información sobre como este manual es desarrollado puede encontrarse en el apéndice 'Sobre este manual'

source: By putting engine off in the appropriate places in the httpd.conf file, PHP can be enabled or disabled.
es: Estas funciones están disponibles solamente si ejecutamos PHP como módulo de Apache.

source: Function Reference
es: Referencia de las Funciones

source: Arrays are essential for storing, managing, and operating on sets of variables.
es: Estas funciones permiten trabajar y manipular matrices (arrays) de diferentes maneras.

source: Simple and multi-dimensional arrays are supported, and may be either user created or created by another function.
es: Las matrices se utilizan para guardar, manejar y operar grupos de variables.

source: There are specific database handling functions for populating arrays from database queries, and several functions return arrays.
es: Matrices simples y multi-dimensionales están soportadas y pueden ser creadas por el usuario u otras funciones.

source: No external libraries are needed to build this extension.
es: Existen funciones específicas de manejo de bases de datos que actualizan matrices con el resultado devuelto por la base de datos, numerosas otras funciones devuelven matrices como resultado.

source: This extension has no configuration directives defined in php.ini.
es: Consultar la sección del manual Matrices si quereis una explicación detallada de como las matrices están implementadas en PHP.

source: The constants below are always available as part of the PHP core.
es: Estas funciones están disponibles como parte del módulo estandar, el cual está siempre disponible.

source: This is also the default case for array_change_key_case().
es: No se necesita ninguna instalación para usar estas funciones, son parte del núcleo de PHP.

source: CASE_UPPER is used with array_change_key_case() and is used to convert array keys to upper case.
es: Esta extensión no define ninguna directiva de configuración.

source: SORT_ASC is used with array_multisort() to sort in ascending order.
es: Esta extensión no define ningún tipo de recurso.

source: Sorting type flags: used by various sort functions
es: CASE_UPPER y CASE_LOWER son usadas con la función array_change_key_case().

source: SORT_NUMERIC is used to compare items numerically.
es: Son usadas respectivamente para cambiar una cadena literal de mayúsculas a minúsculas.

source: See also is_array(), explode(), implode(), split(), preg_split(), and join().
es: Ver tambien is_array(), explode(), implode(), split(), y join().

source: The aspell() functions allows you to check the spelling on a word and offer suggestions.
es: La función aspell() permite comprobar la ortografía de una palabra y ofrece alternativas a la misma.

source: aspell works only with very old (up to .27.* or so) versions of aspell library.
es: aspell funciona solamente con versiones muy antiguas (hasta la .27.* mas ó menos) de la biblioteca aspell.

source: Neither this module, nor those versions of aspell library are supported any longer.
es: Ni este módulo ni las versiones de la biblioteca aspell se soportan actualmente.

source: If you want to use spell-checking capabilities in PHP, use pspell If you want to use spell-checking capabilities in PHP, use pspell instead.
es: Si quereis utilizar capacidades de comprobación ortográfica en php, usar pspell.

source: It uses pspell library and works with newer versions of aspell.
es: Utiliza la biblioteca pspell y funciona con versiones recientes de aspell.

source: You need the aspell library, available from: http: / /aspell.sourceforge.net /.
es: Necesitais la biblioteca aspell disponible en: http: / /aspell.sourceforge.net /.

source: See also pspell.
es: Ver tambien pspell.

source: Since PHP 4.0.4, libbcmath is bundled with PHP.
es: Para operaciones matemáticas de precisión arbitraria, PHP tiene disponible la Calculadora Binaria que soporta números de cualquier tamaño y precisión, representados como cadenas de texto.

source: In PHP 4, these functions are only available if PHP was configured with --enable-bcmath.
es: Desde PHP 4.0.4, libbcmath se encuentra incorporada en PHP.

source: In PHP 3, these functions are only available if PHP was NOT configured with --disable-bcmath.
es: No se necesitan bibliotecas externas para esta extensión.

source: You do not need to load any additional extension in order to use these functions.
es: En PHP 4, estas funciones están disponibles solamente si PHP ha sido configurado con --enable-bcmath en PHP 3, estas funciones están disponibles solamente si PHP no ha sido configurado con --disable-bcmath.

source: Number of decimal digits for all bcmath functions.
es: Esta extensión no define ningún tipo de recurso.

source: This extension has no constants defined.
es: Esta extensión no define ninguna constante.

source: The bzip2 functions are used to transparently read and write bzip2 (.bz2) compressed files.
es: Las funciones bzip2 son usadas para leer y escribir de forma transparente, ficheros comprimidos bzip2 (.bz2)

source: This module requires bzip2 / libbzip2 version = 1.0.x.
es: Este módulo usa las funciones de la biblioteca bzip2 de Julian Seward.

source: Bzip2 support in PHP is not enabled by default.
es: El soporte Bzip2 en PHP no está activado por defecto.

source: You will need to use the --with-bz2[ =DIR] configuration option when compiling PHP to enable bzip2 support.
es: Este módulo requiere bzip2 / libbzip2 versión = 1.0.x.

source: This extension defines one resource type: a file pointer identifying the bz2-file to work on.
es: Esta extensión define un tipo de recurso: un puntero de fichero que identifica el fichero bz2 con el que se va a trabajar.

source: This example opens a temporary file and writes a test string to it, then prints out the contents of the file.
es: Este ejemplo abre un fichero temporal, escribe una cadena literal en el y presenta el contenido de dicho fichero.

source: Small bzip2 Example
es: Ejemplo simple de bzip2

source: The intermediary or standard it is based on is the Julian Day Count.
es: La extensión calendar pone a disposición una serie de funciones para simplificar la conversión entre los distintos formatos de calendario.

source: The Julian Day Count is a count of days starting from January 1st, 4713 B.C.
es: El intermediario ó estándar en que se basa es la Cuenta de Días Juliana.

source: To convert between calendar systems, you must first convert to Julian Day Count, then to the calendar system of your choice.
es: La Cuenta de Días Juliana es una cuenta que comienza mucho antes que lo que mucha gente podría necesitar contar (como alrededor del 4000 AC).

source: For more information on Julian Day Count, visit http: / /serendipity.magnet.ch / hermetic / cal_stud / jdn.htm.
es: Para convertir entre sistemas de calendario, primero deberá convertir a la Cuenta de Días Juliana y luego al sistema de su elección. ¡La Cuenta de Días es muy diferente del Calendario Juliano!

source: For more information on calendar systems visit http: / /genealogy.org / ~scottlee / cal-overview.html.
es: Para más información sobre la Cuenta de Días Juliana visitar http: / /serendipity.magnet.ch / hermetic / cal_stud / jdn.htm.

source: Excerpts from this page are included in these instructions, and are in quotes.
es: Para más información sobre sistemas de calendario, visitar http: / /genealogy.org / ~scottlee / cal-overview.html.

source: To get these functions to work, you have to compile PHP with --enable-calendar.
es: En estas instrucciones se han incluído extractos entrecomillados de dicha página.

source: The windows version of PHP The windows version of PHP has built in support for this extension.
es: Para que estas funciones funcionen, hay que compilar PHP con la opción --enable-calendar.

source: The constants below are defined by this extension, and will only be available when the extension has either been compiled into PHP or dynamically loaded at runtime.
es: Estas constantes están definidas por esta extensión y estarán disponibles solamente cuando la extensión ha sido o bien compilada dentro de PHP o grabada dinamicamente en tiempo de ejecución.

source: The following constants are available since PHP 4.3.0:
es: Las siguientes constantes se pueden utilizar desde PHP 4.3.0:

source: CCVS is RedHat' s solution to the "middle-man "in credit card processing.
es: Estas funciones interaccionan con el API de CCVS, permitiendo trabajar con CCVS directamente desde un script PHP.

source: It lets you directly address the credit card clearing houses via your *nix box and a modem.
es: CCVS es la solución de RedHat para el intermediario en el procesamiento de tarjetas de crédito.

source: The following references will outline the process.
es: Permite conectar directamente con las centrales de las tarjetas desde una máquina *nix con un módem.

source: CCVS has been discontinued by Red Hat and there are no plans to issue further keys or support contracts.
es: CCVS ha sido discontinuado por Red Hat y no existen planes de ofrecer nuevas funcionalidades ó contratos de ayuda.

source: Those looking for a replacement can consider MCVE by Main Street Softworks as a potential replacement.
es: Los que necesiten usar esta funcionalidad pueden probar MCVE by Main Street Softworks.

source: It is similar in design and has documented PHP support!
es: Es similar en diseño y tiene documentación para su uso con PHP

source: To enable CCVS Support in PHP, first verify your CCVS installation directory.
es: Para activar el soporte de CCVS en PHP hay que tener instalado CCVS en vuestro sistema.

source: You will then need to configure PHP with the --with-ccvs option.
es: Seguidamente es necesario configurar PHP con la opción --with-ccvs.

source: If you use this option without specifying the path to your CCVS installation, PHP will attempt to look in the default CCVS Install location (/ usr / local / ccvs).
es: Si se usa esta opcion sin especificar el directorio donde CCVS está instalado, PHP intentará encontrar CCVS en la localización por defecto (/ usr / local / ccvs).

source: If CCVS is in a non-standard location, run configure with: --with-ccvs=$ccvs_path, where $ccvs_path is the path to your CCVS installation.
es: Si CCVS está instalado en una localización no estándar, ejecutar configure con: --with-ccvs=$ccvs_path, donde $ccvs_path es el directorio donde CCVS esta instalado.

source: Please note that CCVS support requires that $ccvs_path / lib and $ccvs_path / include exist, and include cv_api.h under the include directory and libccvs.a under the lib directory.
es: Tener en cuenta que el soporte de CCVS en PHP necesita que $ccvs_path / lib y $ccvs_path / include existan, que cv_api.h se encuentre en el directorio include y que libccvs.a se encuentre en el directorio lib.

source: Additionally, a ccvsd process will need to be running for the configurations you intend to use in your PHP scripts.
es: Adicionalmente se necesita un proceso ccvs ejecutandose en el sistema para las configuraciones que se ejecuten desde PHP.

source: You will also need to make sure the PHP Processes are running under the same user as your CCVS was installed as (e.g. if you installed CCVS as user'ccvs', your PHP processes must run as'ccvs' as well.)
es: Si ccvs usa el usuario 'ccvs', PHP debe ejecutarse como 'ccvs' tambien).

source: Additional information about CCVS can be found at http: / /www.redhat.com / products / ccvs.
es: Información adicional sobre CCVS se puede encontrar en http: / /www.redhat.com / products / ccvs.
